students = ["Еремян", "Степин", "Чепля", "Леськов"]
course   = ["Высшая математика", "Теория систем", "Бух.учёт", "Алгоритмизация"]
dates    = ["03.07.26", "03.06.26", "03.05.26", "03.04.26"]
grades   = [1, 2, 3, 4, 5]
zero     = [0, 1, 2, 3]      # список индексов для обращения к спискам

for c in zero:                       # перебираем индексы курсов
    if course[c] == "Бух.учёт":     # берём курс по индексу и сравниваем
        for d in zero:               # перебираем индексы дат
            if dates[d] == "03.05.26":   # берём дату по индексу и сравниваем
                for s in zero:           # перебираем индексы студентов
                    if students[s] == students[1]:  # берём студента по индексу
                        for g in zero:              # перебираем индексы оценок
                            print(students[s], grades[g], course[c], dates[d])
                            # выводим: студент, оценка, курс, дата
