students = ["Еремян", "Степин", "Чепля", "Леськов"]
course = ["Высшая математика", "Теория систем", "Бух.учёт", "Алгоритмизация"]
dates = ["03.07.26", "03.06.26", "03.05.26", "03.04.26"]
grades = [1, 2, 3, 4, 5]

for c in course:            # перебираем каждый курс
    if c == "Бух.учёт":    # выбираем только курс "Бух.учёт"
        for d in dates:                # перебираем каждую дату
            if d == "03.05.26":       # выбираем только дату 03.05.26
                for s in students:    # перебираем каждого студента
                    for g in grades:  # перебираем каждую оценку (1,2,3,4,5)
                        print(s, g, c, d)  # выводим: студент, оценка, курс, дата
